* pp 238-242  Programming Projects 1-4, 6-8
* Problem number mention before cell.

# 1

In [1]:
# 1
import pandas as pd
data = pd.read_csv("Units.txt")
# here we can see the out put of 2 columns.
data

         Unit    Converted
0      inches     0.083333
1    furlongs   660.000000
2       yards     3.000000
3     fathoms     6.000000
4        feet     1.000000
5  kilometers  3281.500000
6      meters     3.281500
7       miles  5280.000000
8        rods    16.500000

In [2]:
# We can see the file inthe dataframe structure
# we can display the data
data[5:]

         Unit  Converted
5  kilometers  3281.5000
6      meters     3.2815
7       miles  5280.0000
8        rods    16.5000

# 2

In [3]:
# 2
data = pd.read_csv("Scores.txt")
# print the scores and std
print("mean of the scores: ", data.mean())
print("standard deviation of the scores: ", data.std())

mean of the scores:  Scores    71.0
dtype: float64
standard deviation of the scores:  Scores    14.961489
dtype: float64

In [4]:
# scores or columns of each method
data

    Scores
0       59
1       60
2       65
3       75
4       56
5       90
6       66
7       47
8       98
9       72
10      95
11      71
12      63
13      77

# 3

In [5]:
# will read file in the form of Dataframe
data = pd.read_csv("ALE.txt")
# sort values on basis of Won
data.sort_values(by = "Won",ascending=False)

       State  Won  Lost
2   New York   95    67
0  Baltimore   93    69
3  Tampa Bay   90    72
4    Toronto   73    89
1     Boston   69    93

In [6]:
# We have inserted the percentage in the file
data["Percentage"] = (data.Won /(data.Lost+data.Won))
data

       State  Won  Lost  Percentage
0  Baltimore   93    69    0.574074
1     Boston   69    93    0.425926
2   New York   95    67    0.586420
3  Tampa Bay   90    72    0.555556
4    Toronto   73    89    0.450617

In [7]:
# will sort on basis of percentage
data.sort_values(by = "Percentage",ascending=False)

       State  Won  Lost  Percentage
2   New York   95    67    0.586420
0  Baltimore   93    69    0.574074
3  Tampa Bay   90    72    0.555556
4    Toronto   73    89    0.450617
1     Boston   69    93    0.425926

# 4

In [8]:
# a 
#Create the combined file from above three files
data2 = pd.read_csv("RetiredSen.txt")
data3 = pd.read_csv("NewSen.txt")
list1 = [data2, data3, data]
senate114 = pd.concat(list1)
senate114.head(3)

     Alaska  D Dan Sullivan  Lost      Mark Begich  Percentage    R State  Won
0  Arkansas  D          NaN   NaN       Mark Pryor         NaN  NaN   NaN  NaN
1  Colorado  D          NaN   NaN       Mark Udall         NaN  NaN   NaN  NaN
2   Georgia  R          NaN   NaN  Saxby Chambliss         NaN  NaN   NaN  NaN

In [9]:
# B count the number of R and D and independence
data = pd.read_csv("Senate113.txt")
# easy Method to calculate the each values from the column.
data.R.value_counts()

D    53
R    44
I     2
Name: R, dtype: int64

In [10]:
# C

In [11]:
# D
def main():
    symbol = input("Enter a State:")
    infile = open("Senate113.txt", "r")
    #loop
    for line in infile:
        data = line.split(",")
        if data[1] == symbol:
            print("Senators :",data[0])

In [12]:
# Minnesota
main()

Enter a State:Minnesota
Senators : Amy Klobuchar
Senators : Al Franken

# 6

In [13]:
# We used Pandas to see the file structure
data = pd.read_csv("Mileage.txt")
data

      Model  Gal
0     Prius  2.1
1     Camry  4.1
2   Sebring  4.2
3   Mustang  5.3
4    Accord  4.1
5     Camry  3.8
6     Camry  3.9
7   Mustang  5.2
8    Accord  4.3
9     Prius  2.3
10    Camry  4.2
11   Accord  4.4

In [14]:
# Inserted MPG column
data["MPG"] = 100/data.Gal
data

      Model  Gal        MPG
0     Prius  2.1  47.619048
1     Camry  4.1  24.390244
2   Sebring  4.2  23.809524
3   Mustang  5.3  18.867925
4    Accord  4.1  24.390244
5     Camry  3.8  26.315789
6     Camry  3.9  25.641026
7   Mustang  5.2  19.230769
8    Accord  4.3  23.255814
9     Prius  2.3  43.478261
10    Camry  4.2  23.809524
11   Accord  4.4  22.727273

In [15]:
# As per the screen  first 5 records
data.head()

     Model  Gal        MPG
0    Prius  2.1  47.619048
1    Camry  4.1  24.390244
2  Sebring  4.2  23.809524
3  Mustang  5.3  18.867925
4   Accord  4.1  24.390244

# 7

In [16]:
data = pd.read_csv("Cities.txt")
data.head()

          Name State  Pop_2000  Pop_2010
0     New York    NY      80.1     82.70
1  Los Angeles    CA      36.9     38.84
2      Chicago    IL      29.0     28.70
3      Houston    TX      19.5     22.40
4      Phoenix    AZ      13.2     15.70

In [17]:
# we have to create the New file with increased percentage column
data["Per_Increased"] = ((data.Pop_2010 - data.Pop_2000)/data.Pop_2000)*100
data.head()

          Name State  Pop_2000  Pop_2010  Per_Increased
0     New York    NY      80.1     82.70       3.245943
1  Los Angeles    CA      36.9     38.84       5.257453
2      Chicago    IL      29.0     28.70      -1.034483
3      Houston    TX      19.5     22.40      14.871795
4      Phoenix    AZ      13.2     15.70      18.939394

In [18]:
# Decreasing by the pop increased
data.sort_values(by = "Per_Increased",ascending=False)

                  Name State  Pop_2000  Pop_2010  Per_Increased
16          Fort Worth    TX       5.3      6.90      30.188679
18           Charlotte    NC       5.4      6.80      25.925926
4              Phoenix    AZ      13.2     15.70      18.939394
6          San Antonio    TX      11.4     13.50      18.421053
3              Houston    TX      19.5     22.40      14.871795
15              Austin    TX       6.6      7.50      13.636364
11        Jacksonville    FL       7.4      8.20      10.810811
24  Nashville-Davidson    TN       5.5      6.00       9.090909
20             El Paso    TX       5.6      6.10       8.928571
23             Seattle    WA       5.6      6.00       7.142857
14            Columbus    OH       7.1      7.60       7.042254
9             San Jose    CA       8.9      9.50       6.741573
1          Los Angeles    CA      36.9     38.84       5.257453
7            San Diego    CA      12.2     12.80       4.918033
17             Memphis    TN       6.5      6.80       4.615385
8               Dallas    TX      11.9     12.40       4.201681
12        Indianapolis    IN       7.8      8.10       3.846154
22              Boston    MA       5.9      6.10       3.389831
0             New York    NY      80.1     82.70       3.245943
21           Milwaukee    WI       6.0      6.10       1.666667
19           Baltimore    MD       6.5      6.50       0.000000
2              Chicago    IL      29.0     28.70      -1.034483
13       San Francisco    CA       7.8      7.70      -1.282051
10             Detroit    MI       9.5      9.30      -2.105263
5         Philadelphia    PA      15.2     14.70      -3.289474

# 8

In [23]:
# Load the file and see the columns with header
data = pd.read_csv("Exchrate.txt")
data.head()

     Country    Unit      Rate
0    America  Dollar  1.000000
1  Argentina    Peso  8.405692
2  Australia  Dollar  1.070835
3    Austria    Euro  0.760488
4    Belgium    Euro  0.760488

In [24]:
# A
def main():
    symbol = input("Enter a Country:")
    infile = open("Exchrate.txt", "r")
    #loop
    for line in infile:
        data = line.split(",")
        if data[0] == symbol:
            print("Currency :",data[1])
            print("Exchange Rate: ", data[2])

In [26]:
# DISPLAY WITH CURRENCY
main()

Enter a Country:Chile
Currency : Peso
Exchange Rate:  591.4077

In [29]:
# B
# Order by the Exchange rate
data_sort = data.sort_values(by = "Rate",ascending=True)

In [31]:
# shows first three countries 
data_sort.head(3)

           Country   Unit      Rate
25          Kuwait  Dinar  0.284485
48  United Kingdom  Pound  0.602288
41           Spain   Euro  0.760488

In [ ]:
# C